app/views/posts/_photos.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 13], ["LIMIT", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 13]]
---
<% if post.photos.size == 1 %>