app/views/posts/_posts_list.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (9, 8, 7, 6, 5, 4, 3, 2, 1)
---

    <% if post.photos.size == 1 %>