app/views/posts/show.html.erb

      <div class="align-self-center">
        <% if @post.photos.size == 1 %>
          <%= image_tag @post.photos.first.image.url(:standard), class: "card-img-top" %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 13], ["LIMIT", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 13]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? LIMIT ?  [["post_id", 13], ["LIMIT", 11]]