app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ngon qua di"], ["post_id", 13], ["user_id", 4], ["created_at", "2018-10-11 16:02:20.036052"], ["updated_at", "2018-10-11 16:02:20.036052"]]

  def destroy
    @comment = Comment.find(params[:id])
    @post = @comment.post
    if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]