app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 13], ["user_id", 3], ["created_at", "2018-09-27 13:51:23.877051"], ["updated_at", "2018-09-27 13:51:23.877051"]]
---
  def create
    @like = current_user.likes.build(like_params)
    @post = @like.post
    if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find(params[:id])
    @post = @like.post
    if @like.destroy