app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (13, 12, 11, 10, 9, 8, 7, 6, 5, 4) ORDER BY "likes"."created_at" DESC
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (1, 2)
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2)
---
  def index
    @posts = Post.all.limit(10).includes(:photos, :user, :likes).order('created_at desc')

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dasdsa"], ["user_id", 2], ["created_at", "2018-08-20 10:57:22.908044"], ["updated_at", "2018-08-20 10:57:22.908044"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "noze9wp4etxb4oj8xuim.png"], ["post_id", 2], ["created_at", "2018-08-20 11:29:33.536973"], ["updated_at", "2018-08-20 11:29:33.536973"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save
      if params[:images]
        params[:images].each do |img|
          @post.photos.create(image: params[:images][img])

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 13], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 13], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 3)
---
  def show
    @photos = @post.photos
    @like = @post.likes.includes(:user)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 14]]
---
  def destroy
    if @post.user == current_user
      if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find_by id: params[:id]